Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/eth.h
/* -------- ETH_LFFE : (ETH Offset: 0x1194) (R/W 32) Length Field Frame Errors Register -------- */
#define ETH_LFFE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_LFFE) Length Field Frame Errors Register  Reset Value */

#define ETH_LFFE_LFER_Pos                     _UINT32_(0)                                          /* (ETH_LFFE) Length Field Frame Errors Position */
#define ETH_LFFE_LFER_Msk                     (_UINT32_(0x3FF) << ETH_LFFE_LFER_Pos)               /* (ETH_LFFE) Length Field Frame Errors Mask */
#define ETH_LFFE_LFER(value)                  (ETH_LFFE_LFER_Msk & (_UINT32_(value) << ETH_LFFE_LFER_Pos)) /* Assigment of value for LFER in the ETH_LFFE register */
#define ETH_LFFE_Msk                          _UINT32_(0x000003FF)                                 /* (ETH_LFFE) Register Mask  */


/* -------- ETH_RSE : (ETH Offset: 0x1198) (R/W 32) Receive Symbol Errors Register -------- */
#define ETH_RSE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RSE) Receive Symbol Errors Register  Reset Value */

#define ETH_RSE_RXSE_Pos                      _UINT32_(0)                                          /* (ETH_RSE) Receive Symbol Errors Position */
#define ETH_RSE_RXSE_Msk                      (_UINT32_(0x3FF) << ETH_RSE_RXSE_Pos)                /* (ETH_RSE) Receive Symbol Errors Mask */
#define ETH_RSE_RXSE(value)                   (ETH_RSE_RXSE_Msk & (_UINT32_(value) << ETH_RSE_RXSE_Pos)) /* Assigment of value for RXSE in the ETH_RSE register */
#define ETH_RSE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_RSE) Register Mask  */


/* -------- ETH_AE : (ETH Offset: 0x119C) (R/W 32) Alignment Errors Register -------- */
#define ETH_AE_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_AE) Alignment Errors Register  Reset Value */

#define ETH_AE_AER_Pos                        _UINT32_(0)                                          /* (ETH_AE) Alignment Errors Position */
#define ETH_AE_AER_Msk                        (_UINT32_(0x3FF) << ETH_AE_AER_Pos)                  /* (ETH_AE) Alignment Errors Mask */
#define ETH_AE_AER(value)                     (ETH_AE_AER_Msk & (_UINT32_(value) << ETH_AE_AER_Pos)) /* Assigment of value for AER in the ETH_AE register */
#define ETH_AE_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_AE) Register Mask  */


/* -------- ETH_RRE : (ETH Offset: 0x11A0) (R/W 32) Receive Resource Errors Register -------- */
#define ETH_RRE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RRE) Receive Resource Errors Register  Reset Value */

#define ETH_RRE_RXRER_Pos                     _UINT32_(0)                                          /* (ETH_RRE) Receive Resource Errors Position */
#define ETH_RRE_RXRER_Msk                     (_UINT32_(0x3FFFF) << ETH_RRE_RXRER_Pos)             /* (ETH_RRE) Receive Resource Errors Mask */
#define ETH_RRE_RXRER(value)                  (ETH_RRE_RXRER_Msk & (_UINT32_(value) << ETH_RRE_RXRER_Pos)) /* Assigment of value for RXRER in the ETH_RRE register */
#define ETH_RRE_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_RRE) Register Mask  */


/* -------- ETH_ROE : (ETH Offset: 0x11A4) (R/W 32) Receive Overrun Register -------- */
#define ETH_ROE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_ROE) Receive Overrun Register  Reset Value */

#define ETH_ROE_RXOVR_Pos                     _UINT32_(0)                                          /* (ETH_ROE) Receive Overruns Position */
#define ETH_ROE_RXOVR_Msk                     (_UINT32_(0x3FF) << ETH_ROE_RXOVR_Pos)               /* (ETH_ROE) Receive Overruns Mask */
#define ETH_ROE_RXOVR(value)                  (ETH_ROE_RXOVR_Msk & (_UINT32_(value) << ETH_ROE_RXOVR_Pos)) /* Assigment of value for RXOVR in the ETH_ROE register */
#define ETH_ROE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_ROE) Register Mask  */


/* -------- ETH_IHCE : (ETH Offset: 0x11A8) (R/W 32) IP Header Checksum Errors Register -------- */
#define ETH_IHCE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IHCE) IP Header Checksum Errors Register  Reset Value */

#define ETH_IHCE_HCKER_Pos                    _UINT32_(0)                                          /* (ETH_IHCE) IP Header Checksum Errors Position */
#define ETH_IHCE_HCKER_Msk                    (_UINT32_(0xFF) << ETH_IHCE_HCKER_Pos)               /* (ETH_IHCE) IP Header Checksum Errors Mask */
#define ETH_IHCE_HCKER(value)                 (ETH_IHCE_HCKER_Msk & (_UINT32_(value) << ETH_IHCE_HCKER_Pos)) /* Assigment of value for HCKER in the ETH_IHCE register */
#define ETH_IHCE_Msk                          _UINT32_(0x000000FF)                                 /* (ETH_IHCE) Register Mask  */


/* -------- ETH_TCE : (ETH Offset: 0x11AC) (R/W 32) TCP Checksum Errors Register -------- */
#define ETH_TCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TCE) TCP Checksum Errors Register  Reset Value */

#define ETH_TCE_TCKER_Pos                     _UINT32_(0)                                          /* (ETH_TCE) TCP Checksum Errors Position */
#define ETH_TCE_TCKER_Msk                     (_UINT32_(0xFF) << ETH_TCE_TCKER_Pos)                /* (ETH_TCE) TCP Checksum Errors Mask */
#define ETH_TCE_TCKER(value)                  (ETH_TCE_TCKER_Msk & (_UINT32_(value) << ETH_TCE_TCKER_Pos)) /* Assigment of value for TCKER in the ETH_TCE register */
#define ETH_TCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_TCE) Register Mask  */


/* -------- ETH_UCE : (ETH Offset: 0x11B0) (R/W 32) UDP Checksum Errors Register -------- */
#define ETH_UCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_UCE) UDP Checksum Errors Register  Reset Value */

#define ETH_UCE_UCKER_Pos                     _UINT32_(0)                                          /* (ETH_UCE) UDP Checksum Errors Position */
#define ETH_UCE_UCKER_Msk                     (_UINT32_(0xFF) << ETH_UCE_UCKER_Pos)                /* (ETH_UCE) UDP Checksum Errors Mask */
#define ETH_UCE_UCKER(value)                  (ETH_UCE_UCKER_Msk & (_UINT32_(value) << ETH_UCE_UCKER_Pos)) /* Assigment of value for UCKER in the ETH_UCE register */
#define ETH_UCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_UCE) Register Mask  */


/* -------- ETH_AFP : (ETH Offset: 0x11B4) (R/W 32) UDP Checksum Errors Register -------- */
#define ETH_AFP_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_AFP) UDP Checksum Errors Register  Reset Value */

#define ETH_AFP_RDMAFP_Pos                    _UINT32_(0)                                          /* (ETH_AFP) Receive DMA Flushed Packets Position */
#define ETH_AFP_RDMAFP_Msk                    (_UINT32_(0xFFFF) << ETH_AFP_RDMAFP_Pos)             /* (ETH_AFP) Receive DMA Flushed Packets Mask */
#define ETH_AFP_RDMAFP(value)                 (ETH_AFP_RDMAFP_Msk & (_UINT32_(value) << ETH_AFP_RDMAFP_Pos)) /* Assigment of value for RDMAFP in the ETH_AFP register */
#define ETH_AFP_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_AFP) Register Mask  */


